In [2]:
import pandas as pd

In [12]:
valores = [6,8,34,94,78]
indice= range(len(valores))

serie1= pd.Series(data=valores, index= indice)
serie1

0     6
1     8
2    34
3    94
4    78
dtype: int64

In [13]:
valores2= [28, 45,-852 , 3, 16]
serie2= pd.Series(index=indice, data=valores2)
serie2

0     28
1     45
2   -852
3      3
4     16
dtype: int64

In [17]:
serie1 * serie2

0      168
1      360
2   -28968
3      282
4     1248
dtype: int64

In [18]:
34**(-852)

0.0

In [19]:
import numpy as np

In [20]:
array= np.random.normal(-10,10, size=[4,4])
array

array([[ -6.24196717,   1.1310278 ,  16.34793431, -20.13195698],
       [ -0.80858773, -12.27218333, -20.00640429,  -9.34953532],
       [ 10.93375316, -19.71735764, -35.82707948,   0.76991618],
       [-26.77687809,   7.07674615, -20.23796625, -24.39176066]])

In [22]:
pd.DataFrame([[2,3],[4,5]], index=['a','b'], columns=['W','X'])

   W  X
a  2  3
b  4  5

In [23]:
pd.DataFrame(array)

           0          1          2          3
0  -6.241967   1.131028  16.347934 -20.131957
1  -0.808588 -12.272183 -20.006404  -9.349535
2  10.933753 -19.717358 -35.827079   0.769916
3 -26.776878   7.076746 -20.237966 -24.391761

In [24]:
len(array)

4

In [28]:
df=pd.DataFrame(array, index=range(1, len(array)+1), columns=['W','X','Y','Z'])
df

           W          X          Y          Z
1  -6.241967   1.131028  16.347934 -20.131957
2  -0.808588 -12.272183 -20.006404  -9.349535
3  10.933753 -19.717358 -35.827079   0.769916
4 -26.776878   7.076746 -20.237966 -24.391761

In [29]:
df['X']

1     1.131028
2   -12.272183
3   -19.717358
4     7.076746
Name: X, dtype: float64

In [30]:
type(df['X'])

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df['X'][2]

np.float64(-12.272183325742791)

In [33]:
df.X

1     1.131028
2   -12.272183
3   -19.717358
4     7.076746
Name: X, dtype: float64

In [34]:
df[ ['W', 'Y'] ]

           W          Y
1  -6.241967  16.347934
2  -0.808588 -20.006404
3  10.933753 -35.827079
4 -26.776878 -20.237966

In [35]:
columnas= ['W','Y']
df[columnas]

           W          Y
1  -6.241967  16.347934
2  -0.808588 -20.006404
3  10.933753 -35.827079
4 -26.776878 -20.237966

In [38]:
df['suma_X_Z']=df.X +df.Z
df

           W          X          Y          Z   suma_x_z   suma_X_Z
1  -6.241967   1.131028  16.347934 -20.131957 -19.000929 -19.000929
2  -0.808588 -12.272183 -20.006404  -9.349535 -21.621719 -21.621719
3  10.933753 -19.717358 -35.827079   0.769916 -18.947441 -18.947441
4 -26.776878   7.076746 -20.237966 -24.391761 -17.315015 -17.315015

In [42]:
df.drop('suma_x_z',axis=1, inplace=True) #inplace hace el cambio definitivo, no solo para ese comando

In [43]:
df.drop('Y',axis=1) # axis 1 borra columnas, axis 0 borra filas)

           W          X          Z   suma_X_Z
1  -6.241967   1.131028 -20.131957 -19.000929
2  -0.808588 -12.272183  -9.349535 -21.621719
3  10.933753 -19.717358   0.769916 -18.947441
4 -26.776878   7.076746 -24.391761 -17.315015

In [44]:
df.drop('Y',axis=1, inplace=True)

In [45]:
df

           W          X          Z   suma_X_Z
1  -6.241967   1.131028 -20.131957 -19.000929
2  -0.808588 -12.272183  -9.349535 -21.621719
3  10.933753 -19.717358   0.769916 -18.947441
4 -26.776878   7.076746 -24.391761 -17.315015

In [46]:
df.drop(3,axis=0)

           W          X          Z   suma_X_Z
1  -6.241967   1.131028 -20.131957 -19.000929
2  -0.808588 -12.272183  -9.349535 -21.621719
4 -26.776878   7.076746 -24.391761 -17.315015

In [47]:
df

           W          X          Z   suma_X_Z
1  -6.241967   1.131028 -20.131957 -19.000929
2  -0.808588 -12.272183  -9.349535 -21.621719
3  10.933753 -19.717358   0.769916 -18.947441
4 -26.776878   7.076746 -24.391761 -17.315015

In [48]:
df.loc[3]

W           10.933753
X          -19.717358
Z            0.769916
suma_X_Z   -18.947441
Name: 3, dtype: float64

In [49]:
df.loc[1]

W           -6.241967
X            1.131028
Z          -20.131957
suma_X_Z   -19.000929
Name: 1, dtype: float64

In [50]:
df.iloc[0]

W           -6.241967
X            1.131028
Z          -20.131957
suma_X_Z   -19.000929
Name: 1, dtype: float64

In [51]:
df.iloc[ [0,2] ]

           W          X          Z   suma_X_Z
1  -6.241967   1.131028 -20.131957 -19.000929
3  10.933753 -19.717358   0.769916 -18.947441

In [52]:
df.loc[3,'X']

np.float64(-19.717357638665415)

In [53]:
df.loc[ [2,4], ['X', 'suma_X_Z']]

           X   suma_X_Z
2 -12.272183 -21.621719
4   7.076746 -17.315015